// 4. С помощью оператора while напишите программу вывода всех четных чисел в диапазоне от 2 до 100
 //включительно.

package by.htp.les07.main;

public class Task04 {

	public static void main(String[] args) {
		int i = 2;
		while (i <= 100) {
			System.out.println(i);
			i = i + 2;
		}

	}

}
