//2. Составить программу сравнения двух чисел 1 и 2.
//Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no»
package by.htp.les03.main;

public class Main2 {

	public static void main(String[] args) {
		int a;
		int b;
		a = 6;
		b = 9;
		if (a > b) {
			System.out.println("no");
		}else {
			System.out.println("yes");
		}

	}

}
