//Составить программу сравнения двух чисел 1 и 2.
//Если 1 меньше 2 – вывести на экран цифру 7, в противном случае – цифру 8.
package by.htp.les03.main;

public class Main {

	public static void main(String[] args) {
		int a;
		int b;
		a = 6;
		b = 9;
		if (a > b) {
			System.out.println("8");
		}else {
			System.out.println("7");
		}

	}

}
